package run.star.plan.map;

import com.alibaba.fastjson.JSONObject;
import com.google.common.collect.Lists;
import com.google.common.collect.Maps;

import java.util.Collections;
import java.util.HashMap;
import java.util.List;
import java.util.Map;

/**
 * @author hecs
 * @date 2021/3/15 14:53
 */
public class MapTest {
    public static Map<String, Integer> frequencyOfListElements(List<Integer> items) {
        if (items == null || items.size() == 0)
            return null;
        Map<String, Integer> map = new HashMap<String, Integer>();
        for (Integer temp : items) {
            String key = String.valueOf(temp);
            if (map.containsKey(key)) {
                map.put(key, map.get(key) + 1);
            } else {
                map.put(key, 1);
            }
        }
        return map;
    }

    public static void main(String[] args) {
        List<Integer> list = Lists.newArrayList(10, 13, 12, 11, 10, 10, 10, 11, 8, 8, 11, 11, 22, 15, 17, 14, 11, 12, 20, 23, 19, 17, 15, 14, 11, 11, 10, 10, 10, 10, 2, 11, 13, 10, 14, 14, 14, 14, 14, 14, 14, 14, 11, 11, 9, 10, 8, 8, 11, 11, 11, 13, 11, 22, 12, 23, 23, 21, 17, 15, 14, 13, 12, 11, 10, 10, 11, 10, 12, 21, 6, 3, 8, 7, 10, 10, 14, 12, 11, 18, 17, 10, 14, 11, 14, 22, 17, 15, 14, 2, 10, 11, 10, 10, 17, 17, 10, 10, 11, 10, 9, 10, 10, 11, 11, 10, 10, 11, 18, 10, 10, 10, 19, 10, 18, 11, 11, 10, 11, 10, 10, 8, 8, 11, 11, 11, 10, 9, 2, 4, 10, 11, 11, 18, 14, 12, 10, 20, 11, 10, 8, 13, 12, 10, 12, 10, 10, 11, 10, 10, 10, 9, 3, 19, 10, 13, 10, 13, 19, 12, 15, 13, 10, 8, 8, 11, 11, 17, 9, 10, 11, 10, 10, 11, 10, 2, 7, 9, 10, 11, 10, 21, 10, 14, 17, 13, 12, 10, 11, 15, 14, 14, 18, 9, 10, 10, 10, 8, 8, 11, 11, 9, 9, 11, 10, 10, 9, 10, 9, 10, 10, 10, 10, 10, 10, 10, 8, 8, 11, 11, 11, 10, 18, 10, 10, 8, 8, 11, 11, 7, 7, 8, 11, 11, 4, 4, 7, 7, 22, 22, 23, 23, 2, 2, 5, 5, 15, 15, 11, 10, 10, 10, 14, 15, 20, 18, 11, 10, 9, 10, 10, 11, 8, 8, 11, 11, 16, 12, 10, 17, 16, 15, 12, 11, 19, 12, 10, 9, 10, 11, 13, 11, 5, 11, 8, 11, 10, 11, 10, 12, 11, 10, 18, 19, 14, 10, 19, 10, 12, 10, 11, 8, 8, 11, 11, 13, 11, 10, 12, 11, 10, 14, 9, 10, 11, 19, 15, 13, 12, 11, 13, 9, 14, 3, 8, 2, 22, 12, 12, 13, 12, 12, 11, 10, 8, 2, 10, 15, 11, 11, 11, 10, 2, 10, 11, 10, 10, 11, 11, 12, 12, 10, 17, 11, 11, 11, 10, 8, 13, 12, 10, 10, 12, 11, 11, 9, 10, 10, 11, 11, 7, 9, 10, 18, 10, 10, 12, 12, 10, 10, 9, 11, 10, 13, 12, 11, 11, 11, 10, 10, 4, 11, 10, 9, 10, 10, 12, 8, 11, 11, 8, 11, 11, 11, 10, 8, 11, 13, 2, 15, 14, 12, 10, 19, 17, 10, 8, 11, 11, 10, 23, 22, 17, 10, 15, 17, 11, 11, 14, 11, 10, 10, 14, 6, 12, 11, 10, 15, 13, 12, 3, 10, 7, 9, 9, 10, 8, 12, 8, 16, 23, 9, 10, 8, 8, 11, 11, 10, 10, 11, 10, 4, 10, 14, 13, 9, 10, 10, 13, 10, 11, 10, 10, 6, 9, 8, 8, 11, 11, 9, 9, 8, 8, 9, 9, 13, 6, 6, 20, 20, 13, 13, 16, 16, 8, 8, 6, 6, 9, 9, 16, 16, 13, 13, 20, 20, 8, 5, 9, 8, 8, 15, 4, 23, 13, 6, 19, 8, 8, 6, 6, 9, 9, 16, 16, 13, 13, 20, 20, 11, 20, 11, 7, 16, 13, 12, 10, 9, 6, 18, 8, 3, 15, 4, 21, 23, 2, 14, 5, 17, 22, 19, 4, 5, 6, 7, 8, 9, 10, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 23, 22, 3, 11, 2, 11, 10, 12, 22, 22, 15, 9, 9, 8, 8, 8, 8, 8, 8, 8, 8, 2, 9, 8, 9, 2, 1, 2, 1, 1, 1, 1);
        Collections.sort(list);

        String jsonStr = "[{\"id\":1,\"title\":\"夕阳和星空\"},{\"id\":2,\"title\":\"如何陪孩子学好语文？\"},{\"id\":3,\"title\":\"如何说，孩子才能听得进？\"},{\"id\":4,\"title\":\"关于初升高，家长必知的几个要点！\"},{\"id\":5,\"title\":\"父母如何陪伴，孩子才能高效学习？\"},{\"id\":6,\"title\":\"如何引导孩子合理使用网络？\"},{\"id\":7,\"title\":\"家长如何做，孩子才能爱上学习？\"},{\"id\":8,\"title\":\"培养孩子自主学习力，做这3点就够了！\"},{\"id\":9,\"title\":\"期末考后，如何与孩子谈成绩才有用！\"},{\"id\":10,\"title\":\"了解孩子最讨厌、最无用的聊天方式，三招搞定叛逆娃。\"},{\"id\":11,\"title\":\"一榜样，二契约，三三坑，三步教你帮助孩子脱离手机沉迷\"},{\"id\":12,\"title\":\"考试、考试！家长心态稳，孩子考试肯定超常发挥！\"},{\"id\":13,\"title\":\"孩子总是粗心大意，简单三步赶跑粗心。\"},{\"id\":14,\"title\":\"打也打了，骂也骂了！还是偷偷玩手机！想让孩子放下手机，先倾听孩子的想法吧！\"},{\"id\":15,\"title\":\"学习不主动，是缺乏学习动力！挖掘孩子内心所热爱的，激发孩子的学习动力！\"},{\"id\":16,\"title\":\"寒假规划提前来！心里有数，第一步协助孩子科学规划；第二步，学会查漏补缺；第三步，已有资源用起来！具体怎么做看完整视频吧！\"},{\"id\":17,\"title\":\"孩子叛逆了！说一句他顶十句，试着倾听一下孩子得想法，你的话孩子也能听进去咯！\"},{\"id\":18,\"title\":\"孩子早恋，该怎么办？苦口婆心的劝，雷霆手段的阻止。先别急！一，有好感并不等于早恋；二，说说自己的青春故事。\"},{\"id\":19,\"title\":\"青春期孩子总担心拒绝了就做不成好朋友了，那该怎么正确拒绝对方呢？家长可以这样引导。\"},{\"id\":20,\"title\":\"孩子天天抱着手机聊个不停，沉迷网络聊天该怎么办？一要正确情感沟通；二要减少说教；三是安排其他业余活动。\"},{\"id\":21,\"title\":\"沉迷网络，什么方法都使了就是没有效果！一挖掘孩子的特长，二培养孩子兴趣爱好，三鼓励参与娱乐活动！\"},{\"id\":22,\"title\":\"年度催泪读信，初中父母必看！我家孩子现在对夸奖和肯定一点都不在乎！真的吗？我们要一起来看看孩子的内心话吧！\"},{\"id\":23,\"title\":\"考试来临！你是怎么鼓励孩子的呢！倾听孩子的内心世界和渴望，你鼓励孩子朝前三十，前二十，前十。孩子听到的可能只是你的批评和不满意而已！\"}]";
        List<MapBean> mapList = JSONObject.parseArray(jsonStr, MapBean.class);
        Map<Integer, String> nameMap = Maps.newHashMap();
        mapList.forEach(mapBean -> {
            nameMap.put(mapBean.getId(), mapBean.getTitle());
        });

        frequencyOfListElements(list).forEach((key, value) -> {
//            System.out.println(nameMap.get(Integer.valueOf(key)));
            System.out.println(value);
        });
    }
}
